Vulintus/Vulintus_Board_Definitions/hardware/samd/0.1.0/boards.txt
vulintus_omnitrak_controller.name=Vulintus OmniTrak Controller

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4289, submitted by Drew on 1/13/2022
vulintus_omnitrak_controller.vid.0=0x04D8    
vulintus_omnitrak_controller.pid.0=0xE6C3    
vulintus_omnitrak_controller.build.vid=0x04D8
vulintus_omnitrak_controller.build.pid=0xE6C3

# Upload
vulintus_omnitrak_controller.upload.offset=0x4000
vulintus_omnitrak_controller.upload.protocol=sam-ba
vulintus_omnitrak_controller.upload.maximum_size=1032192
vulintus_omnitrak_controller.upload.tool=bossac18
vulintus_omnitrak_controller.upload.use_1200bps_touch=true
vulintus_omnitrak_controller.upload.wait_for_upload_port=true
vulintus_omnitrak_controller.upload.native_usb=true

# Build
vulintus_omnitrak_controller.build.board=OMNITRAK_CONTROLLER
vulintus_omnitrak_controller.build.cache_flags=-DENABLE_CACHE
vulintus_omnitrak_controller.build.core=arduino
vulintus_omnitrak_controller.build.extra_flags=-D__SAMD51P20A__ -DVULINTUS_OMNITRAK_CONTROLLER -D__SAMD51__ -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16 {build.usb_flags}
vulintus_omnitrak_controller.build.flags.optimize=-Os
vulintus_omnitrak_controller.build.f_cpu=120000000L
vulintus_omnitrak_controller.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vulintus_omnitrak_controller.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
vulintus_omnitrak_controller.build.mcu=cortex-m4
# MOVED TO MENU: vulintus_omnitrak_controller.build.openocdscript=openocd_scripts/omnitrak_controller_v2_0.cfg
# MOVED TO MENU: vulintus_omnitrak_controller.build.usb_product="OmniTrak Controller V2.0"
vulintus_omnitrak_controller.build.usb_manufacturer="Vulintus"
# MOVED TO MENU: vulintus_omnitrak_controller.build.variant=omnitrak_controller_v2_0
vulintus_omnitrak_controller.build.variant_system_lib=

# Bootloader
vulintus_omnitrak_controller.bootloader.tool=openocd
vulintus_omnitrak_controller.bootloader.file=omnitrak_controller_v2_0/bootloader-omnitrak_controller_v2_0.bin

# Compiler
vulintus_omnitrak_controller.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu
vulintus_omnitrak_controller.menu.pcb_ver.v2_0=OmniTrak Controller V2.0
vulintus_omnitrak_controller.menu.pcb_ver.v2_0.build.variant=omnitrak_controller_v2_0
vulintus_omnitrak_controller.menu.pcb_ver.v2_0.build.openocdscript=openocd_scripts/omnitrak_controller_v2_0.cfg
vulintus_omnitrak_controller.menu.pcb_ver.v2_0.build.usb_product="OmniTrak Controller V2.0"

# Parameter options formerly set with the menu:
# vulintus_omnitrak_controller.build.cache_flags=-DENABLE_CACHE
# vulintus_omnitrak_controller.build.cache_flags=
# vulintus_omnitrak_controller.build.flags.debug=-g
# vulintus_omnitrak_controller.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
# vulintus_omnitrak_controller.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
# vulintus_omnitrak_controller.build.flags.optimize=-Os
# vulintus_omnitrak_controller.build.flags.optimize=-O2
# vulintus_omnitrak_controller.build.flags.optimize=-O3
# vulintus_omnitrak_controller.build.flags.optimize=-Ofast
# vulintus_omnitrak_controller.build.flags.optimize=-Ofast -funroll-loops
# vulintus_omnitrak_controller.build.flags.usbstack=-DUSE_TINYUSB
# vulintus_omnitrak_controller.build.f_cpu=120000000L
# vulintus_omnitrak_controller.build.f_cpu=150000000L
# vulintus_omnitrak_controller.build.f_cpu=180000000L
# vulintus_omnitrak_controller.build.f_cpu=200000000L


########################################################################################################################
# Vulintus Linear Autopositioner
# ------------------------------

vulintus_linear_autopositioner.name=Vulintus Linear Autopositioner

# VID/PID for Bootloader, Arduino & CircuitPython
vulintus_linear_autopositioner.vid.0=0x239A
vulintus_linear_autopositioner.pid.0=0x8013
vulintus_linear_autopositioner.vid.1=0x239A
vulintus_linear_autopositioner.pid.1=0x0013
vulintus_linear_autopositioner.build.vid=0x239A
vulintus_linear_autopositioner.build.pid=0x8013

# Upload
vulintus_linear_autopositioner.upload.tool=bossac18
vulintus_linear_autopositioner.upload.protocol=sam-ba
vulintus_linear_autopositioner.upload.maximum_size=122880
vulintus_linear_autopositioner.upload.offset=0x2000
vulintus_linear_autopositioner.upload.use_1200bps_touch=true
vulintus_linear_autopositioner.upload.wait_for_upload_port=true
vulintus_linear_autopositioner.upload.native_usb=true

# Build
vulintus_linear_autopositioner.build.mcu=cortex-m0plus
vulintus_linear_autopositioner.build.f_cpu=48000000L
vulintus_linear_autopositioner.build.cache_flags=-DENABLE_CACHE
vulintus_linear_autopositioner.build.flags.optimize=-Os
# MOVED TO MENU: vulintus_linear_autopositioner.build.usb_product="Linear Autopositioner V2.1"
vulintus_linear_autopositioner.build.usb_manufacturer="Vulintus"
vulintus_linear_autopositioner.build.board=LINEAR_AUTOPOSITIONER
vulintus_linear_autopositioner.build.core=arduino
vulintus_linear_autopositioner.build.extra_flags=-D__SAMD21G17A__ -DVULINTUS_LINEAR_AUTOPOSITIONER -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
vulintus_linear_autopositioner.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
# MOVED TO MENU: vulintus_linear_autopositioner.build.openocdscript=openocd_scripts/linear_autopositioner_v2_1.cfg
# MOVED TO MENU: vulintus_linear_autopositioner.build.variant=linear_autopositioner_v2_1
vulintus_linear_autopositioner.build.variant_system_lib=

# Bootloader
vulintus_linear_autopositioner.bootloader.tool=openocd
vulintus_linear_autopositioner.bootloader.file=linear_autopositioner_v2_1/bootloader-linear_autopositioner_v2_1.bin

# Menu
vulintus_linear_autopositioner.menu.pcb_ver.v2_1=Linear Autopositioner V2.1
vulintus_linear_autopositioner.menu.pcb_ver.v2_1.build.variant=linear_autopositioner_v2_1
vulintus_linear_autopositioner.menu.pcb_ver.v2_1.build.openocdscript=openocd_scripts/linear_autopositioner_v2_1.cfg
vulintus_linear_autopositioner.menu.pcb_ver.v2_1.build.usb_product="Linear Autopositioner V2.1"


########################################################################################################################
# Vulintus Liquid Dispenser
# -------------------------

