Vulintus/Vulintus_Board_Definitions/hardware/samd/0.1.0/boards.txt
vulintus_liquid_dispenser.name=Vulintus Liquid Dispenser

# VID/PID for Bootloader, Arduino & CircuitPython
vulintus_liquid_dispenser.vid.0=0x2341
vulintus_liquid_dispenser.pid.0=0x804d
vulintus_liquid_dispenser.vid.1=0x2341
vulintus_liquid_dispenser.pid.1=0x804d
vulintus_liquid_dispenser.build.vid=0x2341
vulintus_liquid_dispenser.build.pid=0x804d

# Upload
vulintus_liquid_dispenser.upload.tool=bossac18
vulintus_liquid_dispenser.upload.protocol=sam-ba
vulintus_liquid_dispenser.upload.maximum_size=122880
vulintus_liquid_dispenser.upload.maximum_data_size=16384
vulintus_liquid_dispenser.upload.offset=0x2000
vulintus_liquid_dispenser.upload.use_1200bps_touch=true
vulintus_liquid_dispenser.upload.wait_for_upload_port=true
vulintus_liquid_dispenser.upload.native_usb=true

# Build
vulintus_liquid_dispenser.build.mcu=cortex-m0plus
vulintus_liquid_dispenser.build.f_cpu=48000000L
vulintus_liquid_dispenser.build.cache_flags=-DENABLE_CACHE
vulintus_liquid_dispenser.build.flags.optimize=-Os
# MOVED TO MENU: vulintus_liquid_dispenser.build.usb_product="Liquid Dispenser V2.0"
vulintus_liquid_dispenser.build.usb_manufacturer="Vulintus"
vulintus_liquid_dispenser.build.board=LIQUID_DISPENSER_V2_0
vulintus_liquid_dispenser.build.core=arduino
vulintus_liquid_dispenser.build.extra_flags=-DCRYSTALLESS -D__SAMD21G17A__ -DVULINTUS_LIQUID_DISPENSER -DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS {build.usb_flags}
vulintus_liquid_dispenser.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
# MOVED TO MENU: vulintus_liquid_dispenser.build.openocdscript=openocd_scripts/liquid_dispenser_v2_0.cfg
# MOVED TO MENU: vulintus_liquid_dispenser.build.variant=liquid_dispenser_v2_0
vulintus_liquid_dispenser.build.variant_system_lib=

# Bootloader
vulintus_liquid_dispenser.bootloader.tool=openocd
vulintus_liquid_dispenser.bootloader.file=liquid_dispenser_v2_0/samd21g17a_sam_ba.bin

# Menu
vulintus_liquid_dispenser.menu.pcb_ver.v2_0=Liquid Dispenser V2.0
vulintus_liquid_dispenser.menu.pcb_ver.v2_0.build.variant=liquid_dispenser_v2_0
vulintus_liquid_dispenser.menu.pcb_ver.v2_0.build.openocdscript=openocd_scripts/liquid_dispenser_v2_0.cfg
vulintus_liquid_dispenser.menu.pcb_ver.v2_0.build.usb_product="Liquid Dispenser V2.0"


########################################################################################################################
# Vulintus Ring Light
# -------------------

vulintus_ring_light.name=Vulintus Ring Light

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4290, submitted by Drew on 1/13/2022
vulintus_ring_light.vid.0=0x04D8    
vulintus_ring_light.pid.0=0xE6C0    
vulintus_ring_light.build.vid=0x04D8
vulintus_ring_light.build.pid=0xE6C0

# Upload
vulintus_ring_light.upload.erase=
vulintus_ring_light.upload.maximum_data_size=4096
vulintus_ring_light.upload.maximum_size=12288
vulintus_ring_light.upload.native_usb=true
vulintus_ring_light.upload.offset=0x1000
vulintus_ring_light.upload.protocol=sam-ba
vulintus_ring_light.upload.tool=bossac19
vulintus_ring_light.upload.use_1200bps_touch=true
vulintus_ring_light.upload.wait_for_upload_port=true

# Build
vulintus_ring_light.build.board=RING_LIGHT_V2_0
vulintus_ring_light.build.cache_flags=-DENABLE_CACHE
vulintus_ring_light.build.core=Fab_SAM_Arduino:arduino
vulintus_ring_light.build.extra_flags=-DCRYSTALLESS -D__SAMD11__ -D__SAMD11C14A__ -DVULINTUS_RING_LIGHT -DARM_MATH_CM0PLUS {build.usb_flags}
vulintus_ring_light.build.f_cpu=48000000L
vulintus_ring_light.build.flags.optimize=-Os
vulintus_ring_light.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vulintus_ring_light.build.mcu=cortex-m0plus
# MOVED TO MENU: vulintus_ring_light.build.openocdscript=openocd_scripts/ring_light_v2_0.cfg
# MOVED TO MENU: vulintus_ring_light.build.usb_product="Ring Light V2.0"
vulintus_ring_light.build.usb_manufacturer="Vulintus"
# MOVED TO MENU: vulintus_ring_light.build.variant=ring_light_v2_0
vulintus_ring_light.build.variant_system_lib=

# Bootloader
vulintus_ring_light.bootloader.tool=openocd
vulintus_ring_light.bootloader.file=ring_light_v2_0/sam_ba_SAMD11C14A.bin

# Menu
vulintus_liquid_dispenser.menu.pcb_ver.v2_0=Ring Light V2.0
vulintus_liquid_dispenser.menu.pcb_ver.v2_0.build.variant=ring_light_v2_0
vulintus_liquid_dispenser.menu.pcb_ver.v2_0.build.openocdscript=openocd_scripts/ring_light_v2_0.cfg
vulintus_liquid_dispenser.menu.pcb_ver.v2_0.build.usb_product="Ring Light V2.0"


########################################################################################################################
# Vulintus Ring Light - FabSam Workaround
# ---------------------------------------

vulintus_ring_light_fab_sam.name=Vulintus Ring Light - FabSam Workaround

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4290, submitted by Drew on 1/13/2022
vulintus_ring_light_fab_sam.vid.0=0x04D8    
vulintus_ring_light_fab_sam.pid.0=0xE6C0    
vulintus_ring_light_fab_sam.build.vid=0x04D8
vulintus_ring_light_fab_sam.build.pid=0xE6C0

# Upload (with Bootloader)
vulintus_ring_light_fab_sam.upload.erase=
vulintus_ring_light_fab_sam.upload.maximum_data_size=4096
vulintus_ring_light_fab_sam.upload.maximum_size=12288
vulintus_ring_light_fab_sam.upload.offset=0x1000
vulintus_ring_light_fab_sam.upload.native_usb=true
vulintus_ring_light_fab_sam.upload.protocol=sam-ba
vulintus_ring_light_fab_sam.upload.tool=Fab_SAM_Arduino:bossac
vulintus_ring_light_fab_sam.upload.use_1200bps_touch=true
vulintus_ring_light_fab_sam.upload.wait_for_upload_port=true

# Build
# vulintus_ring_light_fab_sam.build.board=RING_LIGHT
vulintus_ring_light_fab_sam.build.board=SAMD_ZERO
vulintus_ring_light_fab_sam.build.bootloader_size=__4KB_BOOTLOADER__
vulintus_ring_light_fab_sam.build.buildconfig=CONFIG_H_DISABLED
vulintus_ring_light_fab_sam.build.cache_flags=-DENABLE_CACHE
vulintus_ring_light_fab_sam.build.chip=samd11
vulintus_ring_light_fab_sam.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
vulintus_ring_light_fab_sam.build.core=fab_sam
vulintus_ring_light_fab_sam.build.extra_flags=-D__SAMD11C14A__ -DVULINTUS_RING_LIGHT {build.usb_flags} -DARM_MATH_CM0PLUS
vulintus_ring_light_fab_sam.build.f_cpu=48000000L
vulintus_ring_light_fab_sam.build.floatconfig=FLOAT_BOTH_DOUBLES_ONLY
vulintus_ring_light_fab_sam.build.ldscript=linker_scripts/gcc/4KB_Bootloader/flash_16KB.ld
vulintus_ring_light_fab_sam.build.mathlib=arm_cortexM0l_math
vulintus_ring_light_fab_sam.build.mcu=cortex-m0plus
# MOVED TO MENU: vulintus_ring_light_fab_sam.build.openocdscript=openocd_scripts/ring_light_v2_0_fab_sam.cfg
vulintus_ring_light_fab_sam.build.flags.optimize=-Os
vulintus_ring_light_fab_sam.build.serialcom_uart=NO_UART
vulintus_ring_light_fab_sam.build.serialcom_wire=NO_WIRE
vulintus_ring_light_fab_sam.build.serialcom_spi=NO_SPI
vulintus_ring_light_fab_sam.build.timerconfig=TIMER_732Hz
# MOVED TO MENU: vulintus_ring_light_fab_sam.build.usb_product="Ring Light V2.0"
vulintus_ring_light_fab_sam.build.usb_manufacturer="Vulintus"
vulintus_ring_light_fab_sam.build.usbcom=CDC_ONLY
# MOVED TO MENU: vulintus_ring_light_fab_sam.build.variant=ring_light_v2_0_fab_sam
vulintus_ring_light_fab_sam.build.variant_system_lib=

# Bootloader
vulintus_ring_light_fab_sam.bootloader.file=ring_light_v2_0_fab_sam/sam_ba_SAMD11C14A.bin
vulintus_ring_light_fab_sam.bootloader.tool=edbg

